{
    "version": "1.0",
    "truncation": null,
    "padding": null,
    "added_tokens":
    [
        {
            "id": 0,
            "special": true,
            "content": "[STOP]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false
        },
        {
            "id": 1,
            "special": true,
            "content": "[UNK]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false
        },
        {
            "id": 2,
            "special": true,
            "content": "[SPACE]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false
        }
    ],
    "normalizer": null,
    "pre_tokenizer": null,
    "post_processor": null,
    "decoder": null,
    "model":
    {
        "type": "BPE",
        "dropout": null,
        "unk_token": "[UNK]",
        "continuing_subword_prefix": null,
        "end_of_word_suffix": null,
        "fuse_unk": false,
        "vocab":
        {
            "[STOP]": 0,
            "[UNK]": 1,
            "[SPACE]": 2,
            "!": 3,
            "'": 4,
            "(": 5,
            ")": 6,
            ",": 7,
            "-": 8,
            ".": 9,
            "/": 10,
            ":": 11,
            ";": 12,
            "?": 13,
            "a": 14,
            "aɪ": 15,
            "aʊ": 16,
            "b": 17,
            "d": 18,
            "d͡": 19,
            "d͡ʒ": 20,
            "e": 21,
            "eɪ": 22,
            "f": 23,
            "h": 24,
            "i": 25,
            "j": 26,
            "k": 27,
            "l": 28,
            "m": 29,
            "n": 30,
            "o": 31,
            "oʊ": 32,
            "p": 33,
            "s": 34,
            "t": 35,
            "t͡": 36,
            "t͡ʃ": 37,
            "u": 38,
            "v": 39,
            "w": 40,
            "z": 41,
            "|": 42,
            "æ": 43,
            "ð": 44,
            "ŋ": 45,
            "ɑ": 46,
            "ɔ": 47,
            "ɔɪ": 48,
            "ə": 49,
            "ɚ": 50,
            "ɛ": 51,
            "ɡ": 52,
            "ɪ": 53,
            "ɹ": 54,
            "ʃ": 55,
            "ʊ": 56,
            "ʌ": 57,
            "ʒ": 58,
            "θ": 59,
            "ɐ": 60,
            "ɜ": 61,
            "ᵻ": 62,
            "ɾ": 63,
            "n̩": 64,
            "ː": 65,
            "ɔː": 66,
            "uː": 67,
            "iː": 68,
            "ɑː": 69,
            "oː": 70,
            "ɜː": 71
        },
        "merges":
        [
            "a ɪ",
            "a ʊ",
            "d͡ ʒ",
            "e ɪ",
            "o ʊ",
            "t͡ ʃ",
            "ɔ ɪ",
            "ɔ ː",
            "u ː",
            "i ː",
            "ɑ ː",
            "o ː",
            "ɜ ː"
        ]
    }
}